In [ ]:
import pandas as pd
df=pd.read_csv('datasets/STUDENTSCORE_DATASET.csv')
df

    Hours  Scores
0     2.5      21
1     5.1      47
2     3.2      27
3     8.5      75
4     3.5      30
5     1.5      20
6     9.2      88
7     5.5      60
8     8.3      81
9     2.7      25
10    7.7      85
11    5.9      62
12    4.5      41
13    3.3      42
14    1.1      17
15    8.9      95
16    2.5      30
17    1.9      24
18    6.1      67
19    7.4      69
20    2.7      30
21    4.8      54
22    3.8      35
23    6.9      76
24    7.8      86

In [20]:
df.head()

   Hours  Scores
0    2.5      21
1    5.1      47
2    3.2      27
3    8.5      75
4    3.5      30

In [23]:
df.tail()

    Hours  Scores
20    2.7      30
21    4.8      54
22    3.8      35
23    6.9      76
24    7.8      86

In [21]:
df.shape

(25, 2)

In [22]:
df[2:5]

   Hours  Scores
2    3.2      27
3    8.5      75
4    3.5      30

In [26]:
df.columns

Index(['Hours', 'Scores'], dtype='object')

In [30]:
df.Scores

0     21
1     47
2     27
3     75
4     30
5     20
6     88
7     60
8     81
9     25
10    85
11    62
12    41
13    42
14    17
15    95
16    30
17    24
18    67
19    69
20    30
21    54
22    35
23    76
24    86
Name: Scores, dtype: int64

In [31]:
df.Scores.max()

95

In [32]:
df.Scores.min()

17

In [33]:
df.Scores.mean()

51.48

In [34]:
df.Scores.std()

25.28688724747802

In [35]:
df.describe()

           Hours     Scores
count  25.000000  25.000000
mean    5.012000  51.480000
std     2.525094  25.286887
min     1.100000  17.000000
25%     2.700000  30.000000
50%     4.800000  47.000000
75%     7.400000  75.000000
max     9.200000  95.000000

In [36]:
df.iloc

In [39]:
df.iloc[2]

Hours      3.2
Scores    27.0
Name: 2, dtype: float64

In [20]:
df.iloc[9:10]

   Hours  Scores
9    2.7      25